# YOLO11n Hybrid with GhostConv, GhostSPPF, GhostBottleneck, ECA
nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, GhostConv, [64, 3, 2]]     # 0 - P1/2
  - [-1, 1, GhostConv, [128, 3, 2]]    # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, ECA, [256]]                # 👈 Add ECA after C3k2
  - [-1, 1, GhostConv, [256, 3, 2]]    # 4 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 5
  - [-1, 1, ECA, [512]]                # 👈 Add ECA
  - [-1, 1, GhostConv, [512, 3, 2]]    # 7 - P4/16
  - [-1, 2, C3k2, [512, True]]         # 8
  - [-1, 1, GhostConv, [1024, 3, 2]]   # 9 - P5/32
  - [-1, 2, C3k2, [1024, True]]        # 10
  - [-1, 1, GhostSPPF, [1024, 5]]      # 11 👈 Replaces SPPF
  - [-1, 2, C2PSA, [1024]]             # 12 ✅ Keep C2PSA

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 13
  - [[-1, 8], 1, Concat, [1]]                      # 14 - cat P4
  - [-1, 2, C3k2, [512, False]]                    # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 16
  - [[-1, 5], 1, Concat, [1]]                      # 17 - cat P3
  - [-1, 2, C3k2, [256, False]]                    # 18 (P3/8)

  - [-1, 1, GhostConv, [256, 3, 2]]                # 19
  - [[-1, 15], 1, Concat, [1]]                     # 20 - cat head P4
  - [-1, 2, C3k2, [512, False]]                    # 21 (P4/16)

  - [-1, 1, GhostConv, [512, 3, 2]]                # 22
  - [[-1, 12], 1, Concat, [1]]                     # 23 - cat head P5
  - [-1, 2, C3k2, [1024, True]]                    # 24 (P5/32)

  - [[18, 21, 24], 1, Detect, [nc]]                # 25 - Detect
