nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, GhostConv, [64, 3, 2]]                 # 0 - P1/2
  - [-1, 1, CoordAtt, [64]]                        # 🔹 CoordAtt 1
  - [-1, 1, GhostConv, [128, 3, 2]]                # 2 - P2/4
  - [-1, 1, CoordAtt, [128]]                       # 🔹 CoordAtt 2
  - [-1, 2, C3k2, [256, False, 0.25]]              # 3
  - [-1, 1, GhostBottleneck, [256]]                # 4
  - [-1, 1, ECA, [256]]                            # 5
  - [-1, 1, GhostConv, [256, 3, 2]]                # 6 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]              # 7
  - [-1, 1, CoordAtt, [512]]                       # 🔹 CoordAtt 3
  - [-1, 1, GhostBottleneck, [512]]                # 8
  - [-1, 1, ECA, [512]]                            # 9
  - [-1, 1, GhostConv, [512, 3, 2]]                # 10 - P4/16
  - [-1, 4, A2C2f, [512, True, 4]]                 # 11
  - [-1, 1, CoordAtt, [512]]                       # 🔹 CoordAtt 4
  - [-1, 1, GhostBottleneck, [512]]                # 12
  - [-1, 1, ECA, [512]]                            # 13
  - [-1, 1, GhostConv, [1024, 3, 2]]               # 14 - P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]                # 15
  - [-1, 1, CoordAtt, [1024]]                      # 🔹 CoordAtt 5
  - [-1, 1, GhostBottleneck, [1024]]               # 16
  - [-1, 1, ECA, [1024]]                           # 17
  - [-1, 1, GhostSPPF, [1024]]                     # 18 👈 neck

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 19
  - [[-1, 13], 1, Concat, [1]]                     # 20 - P4
  - [-1, 2, A2C2f, [512, False, -1]]               # 21
  - [-1, 1, GhostBottleneck, [512]]                # 22
  - [-1, 1, CoordAtt, [512]]                       # 🔹 CoordAtt 6
  - [-1, 1, ECA, [512]]                            # 23

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 24
  - [[-1, 9], 1, Concat, [1]]                      # 25 - P3
  - [-1, 2, A2C2f, [256, False, -1]]               # 26
  - [-1, 1, GhostBottleneck, [256]]                # 27
  - [-1, 1, CoordAtt, [256]]                       # 🔹 CoordAtt 7
  - [-1, 1, ECA, [256]]                            # 28

  - [-1, 1, GhostConv, [256, 3, 2]]                # 29
  - [[-1, 23], 1, Concat, [1]]                     # 30
  - [-1, 2, A2C2f, [512, False, -1]]               # 31
  - [-1, 1, GhostBottleneck, [512]]                # 32
  - [-1, 1, CoordAtt, [512]]                       # 🔹 CoordAtt 8
  - [-1, 1, ECA, [512]]                            # 33

  - [-1, 1, GhostConv, [512, 3, 2]]                # 34
  - [[-1, 18], 1, Concat, [1]]                     # 35
  - [-1, 2, C3k2, [1024, True]]                    # 36

  - [[28, 33, 36], 1, Detect, [nc]]                # 37
