# YOLO12n Hybrid with GhostConv, GhostBottleneck, GhostSPPF, and ECA
nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, GhostConv, [64, 3, 2]]     # 0 - P1/2
  - [-1, 1, GhostConv, [128, 3, 2]]    # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, ECA, [256]]                # 3 - attention
  - [-1, 1, GhostConv, [256, 3, 2]]    # 4 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 5
  - [-1, 1, GhostBottleneck, [512]]    # 6
  - [-1, 1, GhostConv, [512, 3, 2]]    # 7 - P4/16
  - [-1, 4, A2C2f, [512, True, 4]]     # 8
  - [-1, 1, ECA, [512]]                # 9
  - [-1, 1, GhostConv, [1024, 3, 2]]   # 10 - P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]    # 11
  - [-1, 1, GhostBottleneck, [1024]]   # 12

head:
  - [-1, 1, GhostSPPF, [1024]]               # 13 👈 replaces any SPPF idea

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 8], 1, Concat, [1]]                   # 15 - cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]            # 16
  - [-1, 1, ECA, [512]]                         # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 5], 1, Concat, [1]]                   # 19 - cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]            # 20
  - [-1, 1, ECA, [256]]                         # 21

  - [-1, 1, GhostConv, [256, 3, 2]]             # 22
  - [[-1, 16], 1, Concat, [1]]                  # 23 - cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]            # 24

  - [-1, 1, GhostConv, [512, 3, 2]]             # 25
  - [[-1, 11], 1, Concat, [1]]                  # 26 - cat head P5
  - [-1, 2, C3k2, [1024, True]]                 # 27

  - [[21, 24, 27], 1, Detect, [nc]]             # 28
